Ran Plan for project: `iam-user` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_user.this["u1"] will be created
+ resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "demouser"
      + path          = "/"
      + tags          = {
          + "created_by" = "atlantis-poc"
          + "team"       = "platform"
        }
      + tags_all      = {
          + "created_by" = "atlantis-poc"
          + "team"       = "platform"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user.this["u2"] will be created
+ resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "dataviewer"
      + path          = "/"
      + tags          = {
          + "created_by" = "atlantis-poc"
          + "team"       = "data"
        }
      + tags_all      = {
          + "created_by" = "atlantis-poc"
          + "team"       = "data"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.managed["u1:arn:aws:iam::aws:policy/ReadOnlyAccess"] will be created
+ resource "aws_iam_user_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + user       = "demouser"
    }

  # aws_iam_user_policy_attachment.managed["u2:arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess"] will be created
+ resource "aws_iam_user_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess"
      + user       = "dataviewer"
    }

  # aws_iam_user_policy_attachment.managed["u2:arn:aws:iam::aws:policy/ReadOnlyAccess"] will be created
+ resource "aws_iam_user_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + user       = "dataviewer"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ created_usernames = [
      + "demouser",
      + "dataviewer",
    ]
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p iam-user
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://0f4347e08d18:4141/lock?id=shimulhumayun%252Fatlantis-iam-user-poc%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p iam-user
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```